# Convert Categorical Data into Numerical Format Using 
### One-Hot_Encoding
### Without using special function

In [1]:
# import libraries
import numpy as np
import pandas as pd

In [2]:
## Created data

student = ["Anuj","Mehul","Harshit","Abhiraj"]
states = ["UP","Delhi","Mumbai","Goa"]
marks = ["70","75","80","85"]

In [3]:
df = pd.DataFrame(np.c_[student,states,marks],columns = ["student","states","marks"])
df.shape

(4, 3)

In [4]:
df

   student  states marks
0     Anuj      UP    70
1    Mehul   Delhi    75
2  Harshit  Mumbai    80
3  Abhiraj     Goa    85

# Solution One

In [5]:
def oneHotEncoder(df_ohe , cat_col, columns):
    for column in columns:
        df_ohe[column] = np.nan
    
    for column in columns:
        for i in range(df_ohe.shape[0]):
            cat_val = df_ohe.loc[i,cat_col]
            if cat_val == column:
                df_ohe.loc[i,column] = 1
            else:
                df_ohe.loc[i,column] = 0
    return df_ohe

In [6]:
cat_col = "states"
columns = df["states"].unique().tolist()
df_one_hot_encoded_1 = oneHotEncoder(df,cat_col,columns)

In [7]:
df_one_hot_encoded_1

   student  states marks   UP  Delhi  Mumbai  Goa
0     Anuj      UP    70  1.0    0.0     0.0  0.0
1    Mehul   Delhi    75  0.0    1.0     0.0  0.0
2  Harshit  Mumbai    80  0.0    0.0     1.0  0.0
3  Abhiraj     Goa    85  0.0    0.0     0.0  1.0

In [8]:
cat_col = "student"
columns = df["student"].unique().tolist()
df_one_hot_encoded_2 = oneHotEncoder(df,cat_col,columns)

In [9]:
df_one_hot_encoded_2

,student,states,marks,UP,Delhi,Mumbai,Goa,Anuj,Mehul,Harshit,Abhiraj
0,Anuj,UP,70,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,Mehul,Delhi,75,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0
2,Harshit,Mumbai,80,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
3,Abhiraj,Goa,85,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0

# Solution Second

In [11]:
df2 = pd.DataFrame(np.c_[student,states,marks],columns = ["student","states","marks"])
df2.shape

(4, 3)

In [12]:
for state in df2["states"].unique().tolist():
    df2[state] = np.where(df2["states"]==state,1,0)

In [13]:
df2

   student  states marks  UP  Delhi  Mumbai  Goa
0     Anuj      UP    70   1      0       0    0
1    Mehul   Delhi    75   0      1       0    0
2  Harshit  Mumbai    80   0      0       1    0
3  Abhiraj     Goa    85   0      0       0    1

In [14]:
for student in df2["student"].unique().tolist():
    df2[student] = np.where(df2["student"]==state,1,0)

In [15]:
df2

,student,states,marks,UP,Delhi,Mumbai,Goa,Anuj,Mehul,Harshit,Abhiraj
0,Anuj,UP,70,1,0,0,0,0,0,0,0
1,Mehul,Delhi,75,0,1,0,0,0,0,0,0
2,Harshit,Mumbai,80,0,0,1,0,0,0,0,0
3,Abhiraj,Goa,85,0,0,0,1,0,0,0,0